GreatCowBASIC/DATFileGenerator/incfiles/OrgFiles/p16F17154.inc
;-----Bank62------------------
RB1I2C           EQU  H'1EE3'
RB2I2C           EQU  H'1EE4'
RC3I2C           EQU  H'1EEB'
RC4I2C           EQU  H'1EEC'
UMTOAP           EQU  H'1F0C'
UMTOAL           EQU  H'1F0D'
UMTOAH           EQU  H'1F0E'

;-----Bank64------------------
STATUS_SHAD      EQU  H'1FE4'
WREG_SHAD        EQU  H'1FE5'
BSR_SHAD         EQU  H'1FE6'
PCLATH_SHAD      EQU  H'1FE7'
FSR0_SHAD        EQU  H'1FE8'
FSR0L_SHAD       EQU  H'1FE8'
FSR0H_SHAD       EQU  H'1FE9'
FSR1_SHAD        EQU  H'1FEA'
FSR1L_SHAD       EQU  H'1FEA'
FSR1H_SHAD       EQU  H'1FEB'
STKPTR           EQU  H'1FED'
TOSL             EQU  H'1FEE'
TOSH             EQU  H'1FEF'


;----- STATUS Bits -----------------------------------------------------
C                EQU  H'0000'
DC               EQU  H'0001'
Z                EQU  H'0002'
NPD              EQU  H'0003'
NTO              EQU  H'0004'
CARRY            EQU  H'0000'
ZERO             EQU  H'0002'


;----- BSR Bits -----------------------------------------------------
BSR0             EQU  H'0000'
BSR1             EQU  H'0001'
BSR2             EQU  H'0002'
BSR3             EQU  H'0003'
BSR4             EQU  H'0004'
BSR5             EQU  H'0005'


;----- INTCON Bits -----------------------------------------------------
INTEDG           EQU  H'0000'
PEIE             EQU  H'0006'
GIE              EQU  H'0007'


;----- PORTA Bits -----------------------------------------------------
RA0              EQU  H'0000'
RA1              EQU  H'0001'
RA2              EQU  H'0002'
RA3              EQU  H'0003'
RA4              EQU  H'0004'
RA5              EQU  H'0005'
RA6              EQU  H'0006'
RA7              EQU  H'0007'


;----- PORTB Bits -----------------------------------------------------
RB0              EQU  H'0000'
RB1              EQU  H'0001'
RB2              EQU  H'0002'
RB3              EQU  H'0003'
RB4              EQU  H'0004'
RB5              EQU  H'0005'
RB6              EQU  H'0006'
RB7              EQU  H'0007'


;----- PORTC Bits -----------------------------------------------------
RC0              EQU  H'0000'
RC1              EQU  H'0001'
RC2              EQU  H'0002'
RC3              EQU  H'0003'
RC4              EQU  H'0004'
RC5              EQU  H'0005'
RC6              EQU  H'0006'
RC7              EQU  H'0007'


;----- PORTE Bits -----------------------------------------------------
RE3              EQU  H'0003'


;----- TRISA Bits -----------------------------------------------------
TRISA0           EQU  H'0000'
TRISA1           EQU  H'0001'
TRISA2           EQU  H'0002'
TRISA3           EQU  H'0003'
TRISA4           EQU  H'0004'
TRISA5           EQU  H'0005'
TRISA6           EQU  H'0006'
TRISA7           EQU  H'0007'


;----- TRISB Bits -----------------------------------------------------
TRISB0           EQU  H'0000'
TRISB1           EQU  H'0001'
TRISB2           EQU  H'0002'
TRISB3           EQU  H'0003'
TRISB4           EQU  H'0004'
TRISB5           EQU  H'0005'
TRISB6           EQU  H'0006'
TRISB7           EQU  H'0007'


;----- TRISC Bits -----------------------------------------------------
TRISC0           EQU  H'0000'
TRISC1           EQU  H'0001'
TRISC2           EQU  H'0002'
TRISC3           EQU  H'0003'
TRISC4           EQU  H'0004'
TRISC5           EQU  H'0005'
TRISC6           EQU  H'0006'
TRISC7           EQU  H'0007'


;----- TRISE Bits -----------------------------------------------------
TRISE3           EQU  H'0003'


;----- LATA Bits -----------------------------------------------------
LATA0            EQU  H'0000'
LATA1            EQU  H'0001'
LATA2            EQU  H'0002'
LATA3            EQU  H'0003'
LATA4            EQU  H'0004'
LATA5            EQU  H'0005'
LATA6            EQU  H'0006'
LATA7            EQU  H'0007'


;----- LATB Bits -----------------------------------------------------
LATB0            EQU  H'0000'
LATB1            EQU  H'0001'
LATB2            EQU  H'0002'
LATB3            EQU  H'0003'
LATB4            EQU  H'0004'
LATB5            EQU  H'0005'
LATB6            EQU  H'0006'
LATB7            EQU  H'0007'


;----- LATC Bits -----------------------------------------------------
LATC0            EQU  H'0000'
LATC1            EQU  H'0001'
LATC2            EQU  H'0002'
LATC3            EQU  H'0003'
LATC4            EQU  H'0004'
LATC5            EQU  H'0005'
LATC6            EQU  H'0006'
LATC7            EQU  H'0007'


;----- PIR0 Bits -----------------------------------------------------
INTF             EQU  H'0000'
IOCIF            EQU  H'0004'
TMR0IF           EQU  H'0005'


;----- PIR1 Bits -----------------------------------------------------
NVMIF            EQU  H'0000'
CRCIF            EQU  H'0001'
SCANIF           EQU  H'0002'
ACTIF            EQU  H'0003'
CSWIF            EQU  H'0004'
OSFIF            EQU  H'0005'
TMR1IF           EQU  H'0006'
TMR1GIF          EQU  H'0007'


;----- PIR2 Bits -----------------------------------------------------
TMR3IF           EQU  H'0000'
TMR3GIF          EQU  H'0001'
TMR2IF           EQU  H'0002'
TMR4IF           EQU  H'0003'
TMR6IF           EQU  H'0004'
CCP1IF           EQU  H'0005'
CCP2IF           EQU  H'0006'


;----- PIR3 Bits -----------------------------------------------------
PWM1PIF          EQU  H'0000'
PWM1IF           EQU  H'0001'
PWM2PIF          EQU  H'0002'
PWM2IF           EQU  H'0003'
PWM3PIF          EQU  H'0004'
PWM3IF           EQU  H'0005'
PWM4PIF          EQU  H'0006'
PWM4IF           EQU  H'0007'


;----- PIR4 Bits -----------------------------------------------------
NCO1IF           EQU  H'0000'
CWG1IF           EQU  H'0001'
CLC1IF           EQU  H'0002'
CLC2IF           EQU  H'0003'
CLC3IF           EQU  H'0004'
CLC4IF           EQU  H'0005'
TX1IF            EQU  H'0006'
RC1IF            EQU  H'0007'


;----- PIR5 Bits -----------------------------------------------------
TX2IF            EQU  H'0000'
RC2IF            EQU  H'0001'
SSP1IF           EQU  H'0002'
BCL1IF           EQU  H'0003'
SSP2IF           EQU  H'0004'
BCL2IF           EQU  H'0005'
CM1IF            EQU  H'0006'
CM2IF            EQU  H'0007'


;----- PIR6 Bits -----------------------------------------------------
ADIF             EQU  H'0000'
ADTIF            EQU  H'0001'
ZCDIF            EQU  H'0002'


